Script started on 2019-01-17 11:41:30-05:00 [TERM="xterm-256color" TTY="/dev/pts/1" COLUMNS="286" LINES="74"]
]0;rounsifr@arch05:~/Desktop/cs452/Lab 1[rounsifr@arch05 Lab 1]$ gc [Kc -Wall -g helloworld.c 
]0;rounsifr@arch05:~/Desktop/cs452/Lab 1[rounsifr@arch05 Lab 1]$ ./a.out 
Hello world.
You the 268435456.000000 person to write this program!
]0;rounsifr@arch05:~/Desktop/cs452/Lab 1[rounsifr@arch05 Lab 1]$ gdb ./a.out 
GNU gdb (GDB) 8.2
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-pc-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x1151: file helloworld.c, line 5.
(gdb) run
Starting program: /home/rounsifr/Desktop/cs452/Lab 1/a.out 

Breakpoint 1, main () at helloworld.c:5
5	  double num = 0.0;
(gdb) step
6	  printf("Hello world.\n");
(gdb) step
Hello world.
7	  num = pow(2,28);
(gdb) print num
$1 = 0
(gdb) step
8	  printf("You the %f person to write this program!\n", num);
(gdb) print num
$2 = 268435456
(gdb) step
You the 268435456.000000 person to write this program!
9	  return 0;
(gdb) step
10	}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 8617] will be killed.

Quit anyway? (y or n) y
]0;rounsifr@arch05:~/Desktop/cs452/Lab 1[rounsifr@arch05 Lab 1]$ exit

Script done on 2019-01-17 11:42:30-05:00 [COMMAND_EXIT_CODE="0"]
